; -------------------------------------------------------------------------------------------------
;
;Мовний файл 7z SFX Builder
;
;Переклад інструкції:
;Розширення мовного файлу повинно бути «.ini».
;НЕ видаляйте назви розділів! (Наприклад: [LangOptions], [Global]...)
;Введіть вашу інформацію про мову в розділі «LangOptions»
;Збережіть файл у форматі Юнікод
;Для включення в основний інсталлятор, відправте електронною поштою новий мовний файли на mirza.b.1695@gmail.com 
;
;Наступні символи мають спеціальне призначення:
;& -При використанні в GUI мітки або кнопки, вона передує букві і
;буде зареєстрована як «гаряча клавіша» для даної функції.
;\n- Символ нового рядка, який буде замінено при відображенні.
;\~n - подвійний символ нового рядка.
;\s - вказує на спеціальні рядки (як правило, імена файлів)
;Порядок і кількість змінних \s дуже важлива і не повинно змінюватись.
;\~s - теж саме що й \s. тільки з лапками.
;
; -------------------------------------------------------------------------------------------------



[LangOptions]
;тут запишіть по-англійськи назву вашої мови
LANG_NAME="Ukrainian"
;тут запишіть оригінальну назву вашої мови
LANG_NATIVE_NAME="Українська"
VERSION=2.0.5
NAME=WoWi4 aka Vladimir_02
;добавте префікс "mailto:', якщо ви вводите вручну адресу електронної пошти
CONTACT=mailto:dvl_02@mail.ru



[Global]
TIP_ADD="Додати"
TIP_EDIT="Редагувати"
TIP_DELETE="Видалити"
TIP_DELETE_ALL="Видалити все"
TIP_MOVE_UP="Перемістити вгору"
TIP_MOVE_DOWN="Перемістити вниз"
BTN_SAVE="Зберегти"
BTN_CANCEL="Скасувати"
CHK_QUOTES="В лапках"
LST_SEC_QUOTES="Лапки"
ERROR_MSG_TITLE="Помилка!"
WARNING_MSG_TITLE="Попередження"
INFORMATION_MSG_TITLE="Інформація"
QUESTION_MSG_TITLE="Запитання"
BTN_OK="ОК"
TEST="Тест"
TIP_BROWSE="Огляд..."
TIP_OPEN="Відкрити розташування файлу"



[Menu]
MENU_FILE="&Файл"
MENU_SETTINGS="&Налаштування"
MENU_HELP="&Довідка"
MI_OPEN="&Відкрити файл..."
MI_RELOAD="&Повторно відкрити"
MI_SAVE="&Зберегти"
MI_SAVE_AS="&Зберегти як..."
MI_CLOSE="&Закрити"
SUB_MENU_RECENT_FILES="&Недавні файли"
MI_CLEAR_LIST="&Очистити список"
MI_EXIT="&Вихід"
MI_OPTIONS="&Параметри"
SUB_MENU_LANG="&Мова"
MI_HELP="&Довідка"
MI_SITE="&Сайт проекту"
MI_ABOUT="&Про програму"
MI_PRESET_MANAGER="Диспетчер шаблонів"



[ToolbarTips]
OPEN="Відкрити файл"
SAVE="Зберегти"
SAVE_AS="Зберегти як"
CLOSE="Закрити файл"
TEST="Тест"
PRESET="Керування профілями"
MAKE_SFX="Створити SFX"
OPTIONS="Налаштування програми"



[TabNames]
MAIN="Головна"
TITLE_TEXT="Заголовок/Текст"
DIALOGS="Діалоги"
RUN="Запуск"
DELETE="Видалення"
SHORTCUTS="Ярлики"
SET_ENV="Змінні"
OUTPUT="Конфіг"
SFX="SFX"



[Tab_Main]
CHK_TEMP_MODE="У тимчасову папку"
CHK_SKIP_LOCKED="Пропустити заблоковані системні файли"
CHK_DELETE_SFX="Видалити SFX-файли після розпакування"
CHK_BPT="Затримка BeginPrompt:"
CHK_XDWIDTH="Ширина діалогового вікна ExtractDialog:"
CHK_XPWIDTH="Ширина ExtractPath:"
RAD_OW_MODE_1="Перезаписувати всі файли"
RAD_OW_MODE_2="Не перезаписувати файли"
RAD_OW_MODE_3="Перезаписати старі файли"
RAD_GUI_MODE_1="Показати повний інтерфейс"
RAD_GUI_MODE_2="Вимкнути кнопку Скасувати при розпакуванні"
RAD_GUI_MODE_3="Приховати всі вікна інтерфейсу"
GRP_OW_MODE="Режим перезапису:"
GRP_GUI_MODE="Режим інтерфейсу:"
LBL_EXT_PATH="Шлях розпакування:"
MI_SFX_NAME="Ім'я SFX-файлу"
MI_SFX_PATH="Шлях SFX"
TIP_EDIT="Клацніть тут, щоб змінити"
TIP_INSERT="Клацніть тут, щоб вставити змінну"
TIP_RELOAD="Оновити"
TIP_OPEN="Відкрити за допомогою текстового редактора"



[Tab_TitleText]
GRP_TITLE="Заголовок"
GRP_TEXT="Текст"
LBL_WIN_TITLE="Заголовок вікна:"
LBL_EXT_PATH_WIN_TITLE="Заголовок вікна шляху розпакувння:"
LBL_EXT_WIN_TITLE="Заголовок вікна розпакувння:"
LBL_ERROR_WIN_TITLE="Заголовок вікна повідомлення про помилку:"
LBL_WARN_WIN_TITLE="Заголовок вікна попередження:"
LBL_PASSWD_TITLE="Заголовок вікна введення паролю:"
LBL_PASSWD_TEXT="Текст вікна введення паролю:"
LBL_EXT_CANCEL_TEXT="Текст вікна скасування розпакування:"



[Tab_RunProgram]
LST_SEC_PARAMETER="Параметри"
LST_SEC_PREFIX="Префікс"
LST_SEC_FILE_FOLDER="Шлях до файлу"
LST_SEC_COMMANDS="Команди"



[Tab_Delete]
LST_SEC_PARAMETER="Параметри"
LST_SEC_FILE_FOLDER="Шлях до файлу або папки"



[Tab_Shortcuts]
LST_SEC_PARAMETER="Параметри"
LST_SEC_PATH="Шлях"
LST_SEC_SRC="Файл"
LST_SEC_CMDS="Команди"
LST_SEC_NAME="Ім'я"
LST_SEC_DESC="Опис"
LST_SEC_DEST="Каталог для ярлика"
LST_SEC_WD="Робочий каталог"
LST_SEC_ICON="Значок"
LST_SEC_INDEX="Індекс"



[Tab_SetEnvironment]
LST_SEC_NAME="Ім'я змінної"
LST_SEC_VALUE="Значення"



[Tab_SFX]
BTN_SELECT="Вибрати..."
BTN_MAKE_SFX="Створити SFX"
BTN_SFX_OPTIONS="Параметри SFX"
BTN_EDIT_VERS="Змінити Метаданні"
CHK_INCLUDE_PATH="Додати шлях у файл конфігурації"
CHK_USE_SELECTED_CFG="Використовувати вибраний файл конфігурації"
GRP_SFX_FILES="SFX-файли"
GRP_SFX_ICON="Значок"
LBL_CONFIG_FILE="Файл конфігурації:"
LBL_7Z_ARCHIVE="7z-архів:"
LBL_SFX_MODULE="Модуль SFX:"
LBL_SFX_PATH="Шлях SFX:"
LBL_SFX_ICON="Значок SFX:"



[GUI_ProgramOptions]
GUI_TITLE="Налаштування програми"
BTN_INTEGRATE="Інтегрувати програму в контекстне меню"
BTN_EXPORT="Експорт..."
MI_REGISTRY="REG-файл..."
MI_INI="INI-файл ..."
CHK_USERMODE="Зберігати налаштування в реєстрі"
CHK_AUTODEFMOD="Користуватись модулем по замовч., якщо в завантаженій конфігурації його нема"
CHK_IGNORE_EMPTY="Не створювати порожні розділи метаданних"
CHK_AUTO_NAME_SFX="Створити SFX-файл в каталозі SFX-архіву, якщо шлях не вказано"
CHK_OVERWRITE_FILES="Замінювати існуючі файли SFX"
GRP_PROGRAM="Програма"
GRP_SFX="SFX"
LBL_LANGUAGE="Мова інтерфейсу:"



[GUI_PresetManager]
GUI_TITLE="Диспетчер шаблонів"
GUI_TITLE2="Новий шаблон"
GUI_TITLE3="Перейменувати шаблон"
BTN_NEW="Створити"
BTN_LOAD="Завантажити"
BTN_SAVE="Зберегти"
BTN_EDIT="Змінити ім'я"
BTN_DELETE="Видалити"
LBL_NAME="Введіть ім'я шаблону:"



[GUI_ArchiveSets]
CHK_SUBFILES="Архівувати тільки файли/папки, розташовані в даній папці"
LBL_DRAGDROP="Ви можете використовувати функцію перетягування для додавання файлів/папок"
TIP_ADDFILE="Додати файли"
TIP_ADDFOLDER="Додати папку"



[GUI_SFXOpts]
GUI_TITLE="Параметри SFX"
TAB_SFX_OPTIONS="Параметри SFX"
TAB_ARCHIVE_FILES="Архівні файли"
CHK_USE_UPX="Стиснути SFX-модуль за допомогою UPX"
CHK_USE_SFX_MOD="Використовувати наступний модуль SFX:"
CMB_USE_7ZIP1="Завжди використовувати 7-Zip"
CMB_USE_7ZIP2="Використовувати 7-Zip, тільки якщо вказані архівні файли"
CMB_USE_7ZIP3="Не використовувати 7-Zip, якщо вказано 7z-архів"
CMB_USE_7ZIP4="Ніколи не використовувати 7-Zip"
LBL_PATH="Шлях до 7-Zip"
TIP_BROWSE="Виберіть шлях до 7-Zip"
TIP_CONFIG="Конфігурація 7-Zip"
7ZIP_TITLE="Конфігурація 7-Zip"
7ZIP_LEVEL="Рівень стискання:"
7ZIP_METHOD="Рівень стискання:"
7ZIP_DICT="Розмір словника:"
7ZIP_SOLID="Розмір суцільного блоку:"



[GUI_VersionInfo]
GUI_TITLE="Відредагувати Метаданні"
BTN_LOAD="Завантажити"
MI_LOAD_SFXMOD="З вибраного модуля SFX"
MI_LOAD_FILE="З файлу..."
MI_LOAD_VALUES="Завантажити значення"
MI_SAVE_VALUES="Зберегти поточні значення"
CHK_INCLUDE="Додати інформацію у файл конфігурації"
CHK_CHANGE_VERS="Змінити інформацію про версію (Метаданні)"



[GUI_Gui.MiscFlags]
GUI_TITLE="Змінити прапорці GUI/Різне"
BTN_NEW="Створити"
BTN_LOAD="Завантажити"
BTN_RESET="Скидання"
BTN_DELETE="Видалити"
LBL_GUI_FLAG_1="Показати відсоток розпакування в рядку заголовка праворуч (за замовчуванням - ліворуч)"
LBL_GUI_FLAG_2="Не відображати відсоток розпакування в рядку заголовка"
LBL_GUI_FLAG_4="Показувати відсоток розпакування під ProgressBar"
LBL_GUI_FLAG_8="Використовувати стиль Windows XP (схема)"
LBL_GUI_FLAG_16="Використовувати жирний шрифт для відсотків розпакування"
LBL_GUI_FLAG_32="Відображати значок у вікні прогресу розпакування"
LBL_GUI_FLAG_64="Використовувати вікно 'BeginPrompt', щоб вказати шлях розпакування"
LBL_GUI_FLAG_128="Використовувати окреме вікно для вказування шляху розпакування"
LBL_GUI_FLAG_256="Підтвердження скасування процесу встановлення/розпакування"
LBL_GUI_FLAG_512="Не відображати значок в рядку заголовка всіх вікон і на [Alt + Tab]"
LBL_GUI_FLAG_1024="Відображати значок у вікні зі шляхом розпакування"
LBL_GUI_FLAG_2048="Відображати значок у вікні 'BeginPrompt'"
LBL_GUI_FLAG_4096="Змінити значок і назви кнопок. Замість 'Да'-'Ні', має бути'OK'-'Скасувати'"
LBL_GUI_FLAG_8192="Не показувати ProgressBar на панелі завдань у Windows 7 або пізніших версіях"
LBL_GUI_FLAG_16384="Показати символ '&&' в текстах"
LBL_MISC_FLAG_1="Не перевіряти вільне місце на диску, яке необхідне для розпакування"
LBL_MISC_FLAG_2="Не перевіряти вільну пам'ять, яка необхідну для розпакування"
LBL_MISC_FLAG_4="Вимагати права адміністратора для всіх операцій"
LBL_MISC_FLAG_8="Показати вікно запиту паролю після вікон 'BeginPrompt' і 'ExtractPath'"



[GUI_RunProgram]
GUI_TITLE="Додати програми які будуть запускатись після розпакування"
GUI_PFX_TITLE="Змінити префікси"
LBL_PARAMETER="Параметр:"
LBL_FILE="Файл:"
LBL_PREFIX="Префікс:"
LBL_COMMANDS="Команди:"



[GUI_Delete]
GUI_TITLE="Додати файли, які будуть видалені після розпакування"
LBL_PARAMETER="Параметр:"
LBL_FILE="Файл/папка:"



[GUI_Shortcuts]
GUI_TITLE="Створити Ярлики після розпакування"
RAD_DESKTOP="Робочий стіл"
RAD_START_MENU="Меню Пуск"
RAD_PROGRAMS="Меню Пуск/Програми"
RAD_STARTUP="Автозавантаження"
RAD_CURRENT_USER="Поточний користувач"
RAD_ALLUSERS="Всі користувачі"
GRP_CREATION_PATH="Де створити"
GRP_CREATE_FOR="Створити для"
GRP_PARAMETER="Параметр:"
LBL_SOURCE_FILE="Файл:"
LBL_ARGUMENTS="Аргументи:"
LBL_NAME="Ім'я ярлика:"
LBL_DESCRIPTION="Опис ярлика:"
LBL_DEST_FOLDER="Каталог з ярликом:"
LBL_WORKING_DIR="Робочий каталог:"
LBL_ICON_FILE="Файл значка:"
LBL_ICON_INDEX="Індекс значка:"



[GUI_SetEnvironment]
GUI_TITLE="Створити змінні середовища"
LBL_NAME="Ім'я:"
LBL_VALUE="Значення:"



[GUI_MakeSFX]
GUI_TITLE="Створення SFX..."
BTN_OPEN="Огляд"
BTN_RUN="Виконати SFX"
BTN_CLOSE="&Закрити"
REPORT_PREP="Підготовка..."
REPORT_ARCHIVE1="Створення архіву..."
REPORT_ARCHIVE2="7-Zip не існує!"
REPORT_ARCHIVE3="Файл не існує: \~s"
REPORT_ARCHIVE4="Архів створено успішно"
REPORT_ARCHIVE5="Не вдалося створити архів!"
REPORT_ERROR1="Не вдається знайти файл конфігурації: \~s"
REPORT_ERROR2="Наступний файл конфігурації не для 7z SFX-файлів: \~s"
REPORT_ERROR3="Помилка при створенні SFX!"
REPORT_ICON1="Зміна значка SFX..."
REPORT_ICON2="Значок SFX змінено успішно"
REPORT_ICON3="Не вдалося змінити значок SFX!"
REPORT_VERSINFO1="Оновлення інформації про версію..."
REPORT_VERSINFO2="Інформацію про версію успішно оновлено"
REPORT_VERSINFO3="Неможливо оновити інформацію про версію!"
REPORT_UPX1="Стискання за допомогою UPX..."
REPORT_UPX2="Стискання успішно завершено"
REPORT_UPX3="Не вдається знайти" upx.exe "!"
REPORT_BUILD1="Збірка SFX..."
REPORT_BUILD2="Помилка при збірці SFX!"
REPORT_FINISH="SFX створено успішно в: \~s"



[MessageBoxes]
;Операції Відкрити/Зберегти файл
MSGBOX1_1="Не вдається знайти мовний файл!"
MSGBOX1_2="Вказаний файл не існує!"
MSGBOX1_3="Файл не завантажено або не існує!"
MSGBOX1_4="Вказаний файл конфігурації не існує!"
MSGBOX1_5="Ви хочете відкрити файл: \~n\~s - ?"
MSGBOX1_6="\~s\nне є файлом конфігурації 7z SFX! \~nБажаєте звантажити його у будь-якому випадку?"
MSGBOX1_7="Розмір файлу більший, ніж звичайний файл конфігурації!\nЗавантажити його у будь-якому випадку?"
MSGBOX1_8="Файл, необхідний для даної операції відсутній:\n \s"
MSGBOX1_9="Цей файл не містить конфігурації! Продовження неможливе!"
MSGBOX1_10="Ви впевнені, що хочете перезавантажити файл?"
MSGBOX1_11="Поточна конфігурація не збережена. Зберегти її?"
MSGBOX1_12="Не вдалося прочитати або записати файл! Переконайтеся, що у вас є права адміністратора."
;Створення SFX
MSGBOX2_1="Шлях вказаний файлом SFX не існує!"
MSGBOX2_2="Модуль SFX не вказано!"
MSGBOX2_3="Зазначений модуль SFX не існує або невірного формату!"
MSGBOX2_4="Файли архіві не вказано!"
MSGBOX2_5="Архів не вказано!"
MSGBOX2_6="Зазначений архів не існує або невірного формату!"
MSGBOX2_7="Перезаписати існуючий файл: \~n\~s - ?"
MSGBOX2_8="7-Zip не існує!"
MSGBOX2_9="Хочете використовувати наступні файл архівів: \~n\~s - ?\~nНатисніть кнопку?" Ні ", якщо ви хочете створити новий архів з файлів зазначених у файлі конфігурації."
;Інші операції
MSGBOX3_1="Програма успішно інтегрована в контекстне меню."
MSGBOX3_2="Натисніть«OK», щоб закрити вікно тестування"
MSGBOX3_3="Хочете перезаписати існуючі значення?"
MSGBOX3_4="Будь ласка, виберіть хоча б один елемент."
MSGBOX3_5="Будь ласка, виберіть тільки один елемент."
MSGBOX3_6="Ви впевнені, що хочете видалити вибрані елементи?"
MSGBOX3_7="Ви впевнені, що хочете видалити всі елементи?"
MSGBOX3_8="Зазначені дані невірні або порожні!"
MSGBOX3_9="Файл не вказано!"


